app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-03-08 02:07:41.735994"], ["updated_at", "2019-03-08 02:07:41.735994"]]
INSERT INTO "artists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-03-08 02:08:39.977694"], ["updated_at", "2019-03-08 02:08:39.977694"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" IS NULL LIMIT 1
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      song = Song.create(title: song[0])
      artist = Artist.find_or_create_by(name: song[1])